usr.bin/innetgr/innetgr.1
.\"	$NetBSD$
.\"
.\" Copyright (c) 1999 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Kimmo Suominen
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd July 5, 2007
.Dt INNETGR 1
.Os
.Sh NAME
.Nm innetgr
.Nd check netgroup members
.Sh SYNOPSIS
.Nm
.Op Fl v
.Op Fl d Ar domain
.Op Fl h Ar host
.Op Fl u Ar user
.Ar netgroup
.Sh DESCRIPTION
.Nm
checks if the specified domain, host or user is a member of
the given netgroup.
This program does not produce any output unless the verbose
.Pq Fl v
flag is given.
.Sh EXIT STATUS
.Bl -tag -width Ds
.It 0
Successful completion.
.It 1
Name not found in group.
.It 2
Invalid usage.
.El
.Sh SEE ALSO
.Xr netgroup 1 ,
.Xr innetgr 3 ,
.Xr netgroup 5
.Sh HISTORY
A
.Nm
utility appeared in
.Nx 1.4 .
