share/man/man4/ata.4
.\"	$NetBSD$
.\"
.\" Copyright (c) 2003 Manuel Bouyer.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd April 28, 2011
.Dt ATA 4
.Os
.Sh NAME
.Nm ata ,
.Nm atabus
.Nd AT attachment (ATA) bus driver
.Sh SYNOPSIS
.Cd "atabus* at wdc? channel ?"
.Cd "atabus* at pciide? channel ?"
.Cd "atabus* at ahcisata? channel ?"
.Sh DESCRIPTION
The
.Nm
driver provides basic low-level functions for the
.Xr wd 4
and
.Xr atapi 4
drivers, for hardware which provides direct access to the ATA registers.
.Sh SEE ALSO
.Xr ahcisata 4 ,
.Xr atapi 4 ,
.Xr intro 4 ,
.Xr pciide 4 ,
.Xr wd 4 ,
.Xr wdc 4
