share/man/man4/epic.4
.\" $NetBSD$
.\"
.\" Copyright (c) 1999 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd June 4, 1999
.Dt EPIC 4
.Os
.Sh NAME
.Nm epic
.Nd
SMC83C170 (EPIC/100)
.Tn Ethernet
driver
.Sh SYNOPSIS
.Cd "epic* at pci? dev ? function ?"
.Sh DESCRIPTION
The
.Nm
driver supports network adapters based on the Standard Microsystems Corp.
83C170
.Tn Ethernet
.Tn PCI
Integrated Controller (EPIC/100).
.Sh SEE ALSO
.Xr ifmedia 4 ,
.Xr intro 4 ,
.Xr pci 4 ,
.Xr ifconfig 8
.Pp
.Lk http://www.smc.com/ "SMC Networks"
.Sh HISTORY
The
.Nm
driver
appeared in
.Nx 1.4 .
.Sh AUTHORS
.An Jason R. Thorpe
