share/man/man4/man4.mvme68k/pcctwo.4
.\" $NetBSD$
.\"
.\" Copyright (c) 1999 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Steve C. Woodford.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd November 28, 1999
.Dt PCCTWO 4 mvme68k
.Os
.Sh NAME
.Nm pcctwo
.Nd MVME167/MVME177 Peripheral Channel Controller 2 device
.Sh SYNOPSIS
.Cd "pcctwo0 at mainbus0"
.Sh DESCRIPTION
The
.Nm
interface serves as an abstraction used by the
.Xr autoconf 4
system to help find and attach devices whose resources are
accessed via the PCCchip2 found on Motorola MVME167 and MVME177
single board computers.
.Pq e.g. the Ethernet and Tn SCSI controllers
.Sh DIAGNOSTICS
.Bl -diag -compact
.It pcctwo0 at mainbus0.
This is the normal autoconfiguration message indicating that the
PCCchip2 has been found and attached to the main processor
bus.
.El
.Sh SEE ALSO
.Xr autoconf 4 ,
.Xr mainbus 4 ,
.Xr pcc 4
