share/man/man9/bcopy.9
.\" Copyright (c) 1990, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" This code is derived from software contributed to Berkeley by
.\" Chris Torek.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     from: @(#)bcopy.3	8.1 (Berkeley) 6/4/93
.\"	$NetBSD$
.\"
.Dd July 7, 2001
.Dt BCOPY 9
.Os
.Sh NAME
.Nm bcopy
.Nd copy byte string
.Sh SYNOPSIS
.In sys/systm.h
.Ft void
.Fn bcopy "const void *src" "void *dst" "size_t len"
.Sh DESCRIPTION
.Bf -symbolic
The
.Fn bcopy
interface is obsolete.
Do not add new code using it.
It will soon be purged.
Use
.Xr memcpy 9
instead.
(The
.Fn bcopy
function is now a macro for
.Xr memcpy 9 . )
.Ef
.Pp
The
.Fn bcopy
function
copies
.Fa len
bytes from string
.Fa src
to string
.Fa dst .
.Pp
.Bf -symbolic
Unlike
.Xr bcopy 3
the two strings must not overlap!
.Ef
In the traditional
.Bx
kernel, overlapping copies were handled by the now-purged
.Fn ovbcopy
function.
If you need to copy overlapping data, see
.Xr memmove 9 .
.Pp
If
.Fa len
is zero, no bytes are copied.
.Sh SEE ALSO
.Xr bcopy 3 ,
.Xr memcpy 9 ,
.Xr memmove 9
