share/man/man9/curproc.9
.\"     $NetBSD$
.\"
.\" Copyright (c) 2002 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Gregory McGarry.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd July 1, 2010
.Dt CURPROC 9
.Os
.Sh NAME
.Nm curproc ,
.Nm curcpu ,
.Nm curlwp
.Nd current process, processor, and
.Tn LWP
.Sh SYNOPSIS
.In sys/proc.h
.Ft struct cpu_info *
.Fn curcpu "void"
.Ft struct proc *
.Fn curproc "void"
.Ft struct lwp *
.Fn curlwp "void"
.Sh DESCRIPTION
The following macros can be used to retrieve
the current processor, process, and light-weight process
.Pq Tn LWP ,
respectively:
.Bl -enum -offset indent
.It
The machine-dependent
.Fn curcpu
macro returns a pointer to a
.Em cpu_info
structure containing information of the
.Tn CPU
that this thread is running on.
.It
The machine-independent
.Fn curproc
macro refers to a pointer to the process currently running on this
.Tn CPU .
.It
The
.Fn curlwp
macro expands to a pointer to
.Em lwp
structure, containing information about the current
.Tn LWP .
This macro is machine-independent,
but machine-dependent
.In machine/cpu.h
may redefine it.
.El
.Sh SEE ALSO
.Xr cpu_number 9 ,
.Xr proc_find 9
